#language: ru
Функционал: Поиск товара

  Сценарий: Поиск телевизора
    
    Когда выбран переход на "Маркет"

    Тогда открыта страница Маркета
    
    Когда выбран раздел меню - "Электроника"
    И выбран раздел подменю - "Телевизоры"

    Тогда переход на страницу поиска

    Когда инициируется переход к фильрам

    Тогда переход на страницу фильтров

    Когда в поле "Цена от" указано значение "20000"
    И выбран чекбокс "Samsung"
    И выбран чекбокс "LG"

    Тогда возврат на страницу поиска

  Сценарий: Поиск наушников

    Когда выбран переход на "Маркет"

    Тогда открыта страница Маркета

    Когда выбран раздел меню - "Электроника"
    И выбран раздел подменю - "Наушники"

    Тогда переход на страницу поиска

    Когда инициируется переход к фильрам

    Тогда переход на страницу фильтров

    Когда в поле "Цена от" указано значение "5000"
    И выбран чекбокс "Beats"

    Тогда возврат на страницу поиска

